In [29]:
import pandas as pd

In [49]:
#Read information from the CSV file into pandas
airline_data=pd.read_csv("Project1.csv")

In [59]:
#Examination of the first five rows to ensure the data's accuracy.
airline_data.head()

,Unnamed: 0,City,Alaska_On_Time,Alaska_Delay,AM WEST_On_Time,AM WEST_Delay,Unnamed: 6,Alaska_F,Alaska_Delayed,T_AMWest,AMWest_Delayed,Most_Delayed_Airline
0,NaN,Los Angeles,497,62,694,117,NaN,559,11.091234,811,14.426634,AMWest
1,NaN,Phoenix,221,12,4840,415,NaN,233,5.150215,5255,7.897241,AMWest
2,NaN,San Diego,212,20,383,65,NaN,232,8.620690,448,14.508929,AMWest
3,NaN,San Francisco,503,102,320,129,NaN,605,16.859504,449,28.730512,AMWest
4,NaN,Seattle,1841,305,201,61,NaN,2146,14.212488,262,23.282443,AMWest

In [64]:
#For each of the five destinations, I determined the percentage of Alaska Airlines flights that had delays.
# The percentage of all flights that are delayed is calculated by dividing the number of delayed flights 
#by the total number of flights. "Alaska_Delayed" is a new column that contains the computation's results.


airline_data['Alaska_F'] = airline_data['Alaska_On_Time'] + airline_data['Alaska_Delay']

airline_data['Alaska_Delayed'] = (airline_data['Alaska_Delay'] / airline_data['Alaska_F']) * 100

airline_data['Alaska_Delayed']

0    11.091234
1     5.150215
2     8.620690
3    16.859504
4    14.212488
Name: Alaska_Delayed, dtype: float64

In [60]:
# The procedure used to determine the percentage of AM West flights that are delayed is the same.
# Enter "AM West_Delayed" as the new column containing the computation's results.


airline_data['T_AMWest'] = airline_data['AM WEST_Delay'] + airline_data['AM WEST_On_Time']

airline_data['AMWest_Delayed'] = (airline_data['AM WEST_Delay'] / airline_data['T_AMWest']) * 100

airline_data['AMWest_Delayed']

0    14.426634
1     7.897241
2    14.508929
3    28.730512
4    23.282443
Name: AMWest_Delayed, dtype: float64

In [61]:
# It is evident that AM West carriers have more delayed flights at every destination when 
#I visually compare the delays of the two carriers at each destination.

airline_data[['Alaska_Delayed', 'AMWest_Delayed']]

   Alaska_Delayed  AMWest_Delayed
0       11.091234       14.426634
1        5.150215        7.897241
2        8.620690       14.508929
3       16.859504       28.730512
4       14.212488       23.282443

In [62]:
for index, row in airline_data.iterrows():
    if row["Alaska_Delayed"] > row["AMWest_Delayed"]:
        airline_data.loc[index, 'Most_Delayed_Airline'] = 'Alaska'
    else:
        airline_data.loc[index, 'Most_Delayed_Airline'] = 'AMWest'

airline_data['Most_Delayed_Airline']

0    AMWest
1    AMWest
2    AMWest
3    AMWest
4    AMWest
Name: Most_Delayed_Airline, dtype: object

In [63]:
airline_data

,Unnamed: 0,City,Alaska_On_Time,Alaska_Delay,AM WEST_On_Time,AM WEST_Delay,Unnamed: 6,Alaska_F,Alaska_Delayed,T_AMWest,AMWest_Delayed,Most_Delayed_Airline
0,NaN,Los Angeles,497,62,694,117,NaN,559,11.091234,811,14.426634,AMWest
1,NaN,Phoenix,221,12,4840,415,NaN,233,5.150215,5255,7.897241,AMWest
2,NaN,San Diego,212,20,383,65,NaN,232,8.620690,448,14.508929,AMWest
3,NaN,San Francisco,503,102,320,129,NaN,605,16.859504,449,28.730512,AMWest
4,NaN,Seattle,1841,305,201,61,NaN,2146,14.212488,262,23.282443,AMWest